app/controllers/api/v1/sessions_controller.rb

  def create
    user_password = params[:session][:password]
    user_login = params[:session][:login]

    user = user_login.present? && User.find_by(email: user_login)

    if user.present? and user.valid_password? user_password
      sign_in user, store: false
      user.generate_authentication_token!
      user.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'admin135@admin.pl' LIMIT 1
UPDATE `users` SET `last_sign_in_at` = '2016-05-02 17:56:28', `current_sign_in_at` = '2016-05-02 17:56:28', `last_sign_in_ip` = '127.0.0.1', `current_sign_in_ip` = '127.0.0.1', `sign_in_count` = 1, `updated_at` = '2016-05-02 17:56:28' WHERE `users`.`id` = 1