app/controllers/api/v1/users_controller.rb

  def index
    users = User.all
---
SELECT  `users`.* FROM `users`  ORDER BY `users`.`id` DESC LIMIT 1

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`, `auth_token`) VALUES ('admin135@admin.pl', '$2a$10$hIrpAC2xFolIuyI9OSIGnelr.Y.EfewSDe1QaBKIeoIu.tnQin5s.', '2016-05-02 17:55:47', '2016-05-02 17:55:47', 'FngqhKv8sUzLpvi6xPN5')