app/controllers/sessions_controller.rb

  def create
    user_password = params[:session][:password]
    user_login = params[:session][:login]

    user = user_login.present? && User.find_by(email: user_login)
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'admin@admin.pl' LIMIT 1